# ShowBorder Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextEditorOptions..::..ShowBorder Property
TextEditorOptions Class See Also
---
Show the border box around the text during editing.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool ShowBorder { get; set; }
```

Visual Basic
---
```text
Public Property ShowBorder As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowBorder {
	bool get ();
	void set (bool value);
}
```

# Remarks
If false, the border will appear or not depending on the edited text note's type Show Border setting. If true, the border will always appear during editing regardless of type settings.
# See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace